Revit 2024 API
BuiltInFailures.BendFailures.NotBentFilledRegion Property
 While making curved beam type "[Type Name]" Filled Region elements were not created
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId NotBentFilledRegion { get; }
Visual Basic
Public Shared ReadOnly Property NotBentFilledRegion As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ NotBentFilledRegion {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.BendFailures Class
Autodesk.Revit.DB Namespace